{"pageProps":{"code":"var Component=(()=>{var l=Object.create;var h=Object.defineProperty;var u=Object.getOwnPropertyDescriptor;var c=Object.getOwnPropertyNames;var w=Object.getPrototypeOf,f=Object.prototype.hasOwnProperty;var y=(o,i)=>()=>(i||o((i={exports:{}}).exports,i),i.exports),g=(o,i)=>{for(var n in i)h(o,n,{get:i[n],enumerable:!0})},a=(o,i,n,t)=>{if(i&&typeof i==\"object\"||typeof i==\"function\")for(let s of c(i))!f.call(o,s)&&s!==n&&h(o,s,{get:()=>i[s],enumerable:!(t=u(i,s))||t.enumerable});return o};var m=(o,i,n)=>(n=o!=null?l(w(o)):{},a(i||!o||!o.__esModule?h(n,\"default\",{value:o,enumerable:!0}):n,o)),p=o=>a(h({},\"__esModule\",{value:!0}),o);var d=y((T,r)=>{r.exports=_jsx_runtime});var G={};g(G,{default:()=>k,frontmatter:()=>b});var e=m(d()),b={title:\"Return To The Tortress\",abstract:'My personal notes of the predic \"Return to the fortress pt.2\" Of Pr. Joel Chemes - Ekklesia - Salta, Argentina.',date:\"2023-06-25\",banner:\"/static/fortress.jpg\"};function v(o={}){let{wrapper:i}=o.components||{};return i?(0,e.jsx)(i,Object.assign({},o,{children:(0,e.jsx)(n,{})})):n();function n(){let t=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",strong:\"strong\",ol:\"ol\",li:\"li\"},o.components);return(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(t.h2,{id:\"god-thinks-of-each-one-of-us-and-knows-our-name\",children:\"God Thinks Of Each One Of Us and Knows Our Name.\"}),(0,e.jsx)(t.p,{children:\"God thinks of each one of us and knows our name. He knows very well who you are. When we get close to God he knows who we are and treasures the good moments of us. How a father melts with love when his son calls him daddy or learns to walk.\"}),(0,e.jsx)(t.p,{children:\"But it is true that sometimes we have committed things that have not been right and that have established at a certain moment an enmity between us and God.\"}),(0,e.jsx)(t.p,{children:\"The Lord still keeps those good moments because he truly loves us and is ready to forgive us, he is ready to embrace us. He is ready to come to meet us when we come to Him. He thinks of you.\"}),(0,e.jsx)(t.h2,{id:\"zechariah-912\",children:\"Zechariah 9:12\"}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:\"Return to your fortress, you prisoners of hope; even now I announce that I will restore twice as much to you.\"})}),(0,e.jsx)(t.p,{children:'\"I will give you two blessings for each difficulty\". The Lord is telling you, for every difficulty I will give you twice the blessing, so relax.'}),(0,e.jsxs)(t.p,{children:[(0,e.jsx)(t.strong,{children:\"The invitation is: come to the fortress.\"}),\" Don't stay in anger, don't stay in defeat, don't stay in weakness, don't stay in anguish, don't stay in sorrow.\"]}),(0,e.jsx)(t.p,{children:\"Those are stations that we must pass through but not stay. We must not get stuck. But quickly, then go through that time of anguish, of pain, of anger. After daring it of course. If you are in anguish, be well anguished, cry well, feel the pain well, do not deny it. And then come to the fortress.\"}),(0,e.jsx)(t.p,{children:\"Remember that the fortress is a place where we can be in times of weakness, which is precisely why it is the fortress. So that we don't have to fight. But that we can cry before the Lord, where we can expose our pain and weakness.\"}),(0,e.jsx)(t.p,{children:\"He is our strength and our heavenly father.\"}),(0,e.jsx)(t.h2,{id:\"he-is-more-than-our-father\",children:\"He Is More Than Our Father\"}),(0,e.jsx)(t.p,{children:(0,e.jsx)(t.strong,{children:\"2 Corinthians 6:18\"})}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:\"I will be a Father to you, and you will be my sons and daughters.\"})}),(0,e.jsx)(t.p,{children:\"We already talked about God being our father. It seems like a redundant, kind of pointless thing to say, but He wants us to be HIS CHILDREN too. Not only does he want to be our father, but he also wants us to have the confidence, the certainty and the attitude of life as his children.\"}),(0,e.jsx)(t.p,{children:(0,e.jsx)(t.strong,{children:\"1 John 3:1\"})}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:\"See what great love the Father has lavished on us, that we should be called children of God! And that is what we are! The reason the world does not know us is that it did not know him.\"})}),(0,e.jsxs)(t.p,{children:[\"He begins by saying look, look, pay attention, this is a visible fact. Look, God calls us children and this means that this is not a theology, this is not a philosophy, ideology or a discourse, it is not a social construction or something that has developed over the years from one idea to another, it is not something that comes from one thought or from yours. It is a fact. And since it is something very clear, very visible, the apostle John began by saying look, \",(0,e.jsx)(t.strong,{children:\"God called us sons and we ARE SONS OF GOD.\"})]}),(0,e.jsx)(t.p,{children:\"God has called you son and you are, it is evident. It is not something that depends even on your faith but it is something that God has done by himself, he has made you to be born again.\"}),(0,e.jsx)(t.p,{children:\"There are two very visible signs of who is a Son of God. And if you want to go back to the Father you must pay attention to have thease singals...\"}),(0,e.jsx)(t.h2,{id:\"the-two-hs-of-son-of-god\",children:\"The Two H's Of Son of God\"}),(0,e.jsx)(t.p,{children:\"What is it that makes a child of God evident wherever he goes?\"}),(0,e.jsxs)(t.ol,{children:[(0,e.jsx)(t.li,{children:\"Honesty: Tt is well visible that any child of God is honest.\"}),(0,e.jsx)(t.li,{children:\"Brotherhood: A child of God is a Brother.\"})]}),(0,e.jsx)(t.p,{children:'A child of God behaves honestly and behaves like a brother. Where do you think the phrase: \"Hey, brother how are you?\" came from?'}),(0,e.jsx)(t.h2,{id:\"honesty\",children:\"Honesty\"}),(0,e.jsx)(t.p,{children:\"We must be Sons of light in such a way that when we are in darkness it bothers us. The holy spirit bears witness to our spirit. I need to be honest with myself and not deceive myself. I must live as he saw and free myself from living a life of self-deception. Free is not the one who does what he wants, free is only the one who does what is right because the one who is free and the one who does what he wants is a prisoner of his actions. The right thing does not imprison you, it gives you freedom. You do not hide. You can live in peace.\"}),(0,e.jsx)(t.p,{children:\"We are honest in our life, we obey our father, honestly I am in the church today, honestly I want to serve him, honestly I want my life to be a blessing, that is our seal.\"}),(0,e.jsx)(t.p,{children:\"1 John 3:7-12\"}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:\"Dear children, do not let anyone lead you astray. The one who does what is right is righteous, just as he is righteous. 8 The one who does what is sinful is of the devil, because the devil has been sinning from the beginning. The reason the Son of God appeared was to destroy the devil\\u2019s work. 9 No one who is born of God will continue to sin, because God\\u2019s seed remains in them; they cannot go on sinning, because they have been born of God.\"})}),(0,e.jsx)(t.p,{children:\"What is the danger of self-deception. Well the danger is to cause doubts in our heart. When we begin to dwell on sins in our life, when we notice weaknesses in our character that are lacking before the Lord. We yield to temptations and we are invaded by this doubt, am I a child of God? Because son of God is written with an H, with H for Honest. And you have these terrible doubts.\"}),(0,e.jsx)(t.p,{children:\"The Holy Spirit shows you when the doubt comes that there is something wrong. As we read, we are purified every day. Ask him to show you the answer to your doubts. Repent and keep honest in God.\"}),(0,e.jsx)(t.h2,{id:\"brotherhood\",children:\"Brotherhood\"}),(0,e.jsx)(t.p,{children:'Learn to forgive and to listen. Not to be divided. Not to be at enmity with anyone. We owe love to each other. The Lord has given us to be born again and ALSO to our brothers and sisters, that is, the people around us. We are brothers and we should bless one another. The apostle Paul says: \"Do good to all, especially to the brethren\". Do good to a brother. If you have to give something, give it to a brother. If you know of a job opening, recommend the brother. And this will increase the assurance that he is a child of God.'}),(0,e.jsx)(t.p,{children:\"Free yourself from thinking badly of someone who attends church or judging him. God calls us Sons. And some of us may think that there are certain people that we do not know why God called them sons, if they practice anything, they do not behave like sons, nor is it evident that they are sons. But God knows, there is something that He has started and He is going to finish it. Because if you did not know it, God calls things that are not as if they were. So if the Lord calls you Son you call him Brother. Leave the doubt to the devil.\"}),(0,e.jsx)(t.p,{children:\"We have to understand that there is something that needs to be perfected. No one is exempt. That is why when we read :\"}),(0,e.jsx)(t.p,{children:(0,e.jsx)(t.strong,{children:\"1 John 3:2\"})}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:\"Dear friends, now we are children of God, and what we will be has not yet been made known. But we know that when Christ appears,[a] we shall be like him, for we shall see him as he is.\"})}),(0,e.jsx)(t.p,{children:\"Here we must emphasize the word Now. This refers to the third H.\"}),(0,e.jsx)(t.h2,{id:\"heir\",children:\"Heir\"}),(0,e.jsxs)(t.p,{children:[\"He has adopted us as His children, because there was a time when we were not children of God, but were lost in the world, doing anything but what it is to be a child of God. But there was a time when you heard the word of the Lord and in your heart you were transformed, you were born again and \",(0,e.jsx)(t.strong,{children:\"NOW\"}),\" you are children of God.\"]}),(0,e.jsx)(t.p,{children:\"But the fact is that now they still struggle with two natures. One of the spirit and one of the flesh.\"}),(0,e.jsx)(t.p,{children:(0,e.jsx)(t.strong,{children:\"Romans 8:17-21\"})}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:\"Now if we are children, then we are heirs\\u2014heirs of God and co-heirs with Christ, if indeed we share in his sufferings in order that we may also share in his glory. I consider that our present sufferings are not worth comparing with the glory that will be revealed in us. 19 For the creation waits in eager expectation for the children of God to be revealed. 20 For the creation was subjected to frustration, not by its own choice, but by the will of the one who subjected it, in hope 21 that[h] the creation itself will be liberated from its bondage to decay and brought into the freedom and glory of the children of God.\"})}),(0,e.jsx)(t.p,{children:\"There is something God is still doing in us. There is still a work that we are waiting for to continue in us. There are things that I still struggle with internally. Sometimes they make me doubt whether I am really a child of God or not. Why if I am a child of God does it seem like I am not? Why if I am a child of God does He not seem to listen to me? Why if I am a child of God does this misfortune seem to happen in my life? Why if I am a child of God do I still fight with this bad temper and hurt those I love the most? Why do I struggle with this? Why do I still suffer this?\"}),(0,e.jsx)(t.p,{children:\"Because the Lord, the Holy Spirit is still doing a work within you. And you are not the only one, says the apostle Paul in Romans, you are not the only one who is waiting for this work to be completed, but all of creation is waiting for it to be so, nature is waiting. The whole world is waiting for the revelation. Because with our sin we wounded and hurt the place where we live. Our city is also waiting for us to rise up as children of God. Your house is waiting. Your family.\"}),(0,e.jsx)(t.p,{children:\"When I said that God knows your name, knows who you are and treasures the best moments of you in his heart. I said it because God is watching and waiting for you. God elbows an angel to his left and says: There is my son, he is going to get up. The Holy Spirit is doing a work in him and at any moment it will be a revolution.\"}),(0,e.jsx)(t.p,{children:\"God is waiting. There is something he has put in you. It is a Holy Inheritance, it is a glorious inheritance.\"}),(0,e.jsx)(t.p,{children:\"God is waiting. There is something that he has put in you. It is a Holy Inheritance, it is a glorious inheritance. God has placed something sublime in you and from today, leaving this blog when you finish reading this post, you can begin to take advantage of what God has placed in you. In the letter to the Galatians, Paul says that God has placed gifts in us: Love, joy, peace, patience, kindness, goodness, faith, meekness, self-control, self-control, courage.\"}),(0,e.jsx)(t.p,{children:\"God expects you to grab these gifts. Because he has plans with you. And he has very good plans. Not very bad.\"}),(0,e.jsx)(t.h2,{id:\"god-has-a-purpose\",children:\"God has a purpose.\"}),(0,e.jsx)(t.p,{children:\"It is normal to think that nothing has a purpose in life, everything is meaningless. My life does not make sense. If I do wrong, who cares? The difficulties I have suffered in my life, what does that mean? What meaning did that death have? What is the meaning of this disease? What sense does it have? And there is the Holy Spirit working within you and the heavenly father saying: Calm down, he's angry, calm down.\"}),(0,e.jsxs)(t.p,{children:[(0,e.jsx)(t.strong,{children:\"Return to the fortress.\"}),\" Are you a prisoner of anger? So, first there is still hope. The Lord is still going to do something. There will come a time when that death, that pain, that illness, that misery experienced, that loss, will be left behind. And maybe there will come a time when you say: Ahhh it was because of this. I don't know.\"]}),(0,e.jsx)(t.p,{children:\"God knows, and he is waiting. Because there are plans that God has not given up on and is waiting for you. Purposes for you to carry out.\"}),(0,e.jsx)(t.p,{children:\"It seems sometimes that we are not yet free from sin. It seems sometimes that we still cannot brotherhood as we would like and fight side by side.\"}),(0,e.jsx)(t.p,{children:\"We go through times in our lives when it seems as if we were not children of God. We go through difficulties that sometimes surpass us and we become distressed. Sometimes we think that the Lord has distanced himself from us or that what we suffer does not make any sense. We battle against pain, with anger, with frustration but the Lord has given us the Holy Spirit as a testimony and upon hearing his voice we must hurry to run to the fortress.\"}),(0,e.jsx)(t.p,{children:\"Zechariah 9:12 was written before the Lord Jesus came. And on that occasion the people were captive. When Jesus came he did it so that we could ALL get out of that prison and be made free.\"}),(0,e.jsx)(t.p,{children:\"Paul says: He did not give us a spirit of slavery, we are Children of hope. God has already broken our chains, He already died on the cross of Calvary, the prison door is already open, your chains are on the floor. The Lord is waiting and we must wait together with Him. God wants to disarm everything that distresses us.\"}),(0,e.jsx)(t.p,{children:\"We suffer here today, it is true, but because we are still waiting for something more glorious than this, but that does not mean that we cannot already achieve some of the glories that God wants to give us. Get up, return to strength, son of hope, because God will give you two blessings for every difficulty.\"}),(0,e.jsx)(t.h2,{id:\"i-wait-in-you\",children:\"I WAIT IN YOU\"})]})}}var k=v;return p(G);})();\n;return Component;","frontmatter":{"title":"Return To The Tortress","abstract":"My personal notes of the predic \"Return to the fortress pt.2\" Of Pr. Joel Chemes - Ekklesia - Salta, Argentina.","date":"2023-06-25","banner":"/static/fortress.jpg"},"timecode":"00:12:00:59","ogImage":"undefined/og/69d69812a83b39498ef4719ad1e14268.png"},"__N_SSG":true}