{"pageProps":{"code":"var Component=(()=>{var l=Object.create;var h=Object.defineProperty;var c=Object.getOwnPropertyDescriptor;var u=Object.getOwnPropertyNames;var f=Object.getPrototypeOf,m=Object.prototype.hasOwnProperty;var p=(o,i)=>()=>(i||o((i={exports:{}}).exports,i),i.exports),w=(o,i)=>{for(var n in i)h(o,n,{get:i[n],enumerable:!0})},s=(o,i,n,t)=>{if(i&&typeof i==\"object\"||typeof i==\"function\")for(let a of u(i))!m.call(o,a)&&a!==n&&h(o,a,{get:()=>i[a],enumerable:!(t=c(i,a))||t.enumerable});return o};var y=(o,i,n)=>(n=o!=null?l(f(o)):{},s(i||!o||!o.__esModule?h(n,\"default\",{value:o,enumerable:!0}):n,o)),b=o=>s(h({},\"__esModule\",{value:!0}),o);var d=p((E,r)=>{r.exports=_jsx_runtime});var G={};w(G,{default:()=>k,frontmatter:()=>g});var e=y(d()),g={title:\"A Miracle At Evening ...\",abstract:'My personal notes of the predic \"A Miracle At Evening\" Of Pr. Daniel Chemes - Ekklesia - Salta, Argentina.',date:\"2022-08-14\",banner:\"/static/hello-world-banner.jpg\"};function v(o={}){let{wrapper:i}=o.components||{};return i?(0,e.jsx)(i,Object.assign({},o,{children:(0,e.jsx)(n,{})})):n();function n(){let t=Object.assign({h2:\"h2\",p:\"p\",blockquote:\"blockquote\",ol:\"ol\",li:\"li\",strong:\"strong\"},o.components);return(0,e.jsxs)(e.Fragment,{children:[(0,e.jsx)(t.h2,{id:\"a-story-of-miracles-from-the-bible\",children:\"A story of miracles from the bible:\"}),(0,e.jsx)(t.p,{children:\"2 kings 7\"}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:`Elisha replied: Hear the word of the Lord, which says thus, \"Tomorrow at this time, at the entrance to Samaria, you may buy one seah[a] of refined flour for one shekel of silver[b] and up to two seahs of barley for the same price.\" 2 The king's personal attendant replied to the man of God: -No shit! Even if the Lord were to open the floodgates of heaven, no such thing could happen! -Well, you'll see it with your own eyes,\" Elisha warned him, \"but you won't get to eat it.`})}),(0,e.jsx)(t.p,{children:\"The nation was going through great difficulties, there were shortages and famine. Elysium said that in 24 hours the city would go from scarcity to abundance. Something a little crazy and implausible.\"}),(0,e.jsx)(t.p,{children:\"Open your heart to say Lord I dispose my heart and soul for a miracle to happen in my life overnight.\"}),(0,e.jsx)(t.p,{children:\"When things could not be worse, when his strength (that of the king and his people) is gone and he was desperate. They were about to starve to death for having turned their backs on the lord. There appeared Elysium to tell them this:\"}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:'\"Listen to the message of the lord: this is what the lord says: tomorrow at this time in the markets of Samaria 3 kilos of flour will cost barely a silver coin.\"'})}),(0,e.jsx)(t.p,{children:'An official of the King, expressing his disbelief, said to the man of God: \"that would be impossible\" \"it would be impossible for there to be so much flour to a city that is dying of hunger even if the Lord opens the window of heaven\" and Elysium answered him:'}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:`\"You will see it with your own eyes but you won't be able to eat any\".`})}),(0,e.jsx)(t.h2,{id:\"the-officials-heart-was-filled-with-disbelief\",children:\"The official's heart was filled with disbelief.\"}),(0,e.jsxs)(t.ol,{children:[(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"He doubted God's power, God could drop food from heaven (as he did with the people during the 40 years in the wilderness).\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"He doubt God's creativity. In this person's mind food had to come from heaven because the city was under siege. He had no idea that God could provide in a strange way. The provision came from an unthinkable place. Verses 3 to 8.\"})}),(0,e.jsx)(t.li,{children:(0,e.jsx)(t.p,{children:\"Doubting God's messenger, the promise was hard to believe. But everything Elysium had anticipated earlier had come to pass.\"})})]}),(0,e.jsx)(t.p,{children:\"How often our faith wants to look like this or is this way, how often we doubt God's power. Unbelief says there is only one way for God to do it, unbelief says that even if God opens the windows of heaven it will not be enough.\"}),(0,e.jsxs)(t.p,{children:[\"We must fight the spirit of unbelief, unbelief will dishonor God. God loves us enough to do whatever he has to do to bless us. And he is wise enough to do things in unthinkable ways. \",(0,e.jsx)(t.strong,{children:\"If there is a limit, it is our lack of faith, lack of belief in God, in his love and power.\"})]}),(0,e.jsx)(t.h2,{id:\"miracle-day-is-the-day-we-must-go-out-the-door-and-wait-for-the-miracle-to-come\",children:\"Miracle day is the day we must go out the door and wait for the miracle to come.\"}),(0,e.jsx)(t.p,{children:\"Israel was delivered from her enemies and the economic miracle was performed.\"}),(0,e.jsx)(t.p,{children:\"The word says that the Lord confounded the enemy army and drove them back. When God's angels begin to move our adversaries and our adversities flee.\"}),(0,e.jsx)(t.p,{children:\"It is necessary to make and advance with firm steps towards the miracle trusting in Him. Wait for God to use this occasion to perform the miracle.\"}),(0,e.jsx)(t.h2,{id:\"2-kings-717-20\",children:\"2 Kings 7:17-20\"}),(0,e.jsx)(t.blockquote,{children:(0,e.jsx)(t.p,{children:`The king had ordered his personal attendant to guard the entrance to the city, but the people ran over him right there, and so what the man of God had said when the king went to his house was fulfilled. 18 It happened just as the man of God had said to the king, \"By this time tomorrow, at the entrance to Samaria, you may buy two seahs of barley for a shekel of silver, and a seah of refined flour for the same price.\" 19 The helper had said to the man of God, \"You don't say to me! Even if the Lord were to open the floodgates of heaven, no such thing could happen!\" So the man of God replied, \"Well, you will see it with your own eyes, but you won't get to eat it.\"`})}),(0,e.jsx)(t.p,{children:\"Everything happened the way Elysium said it was going to happen\"}),(0,e.jsx)(t.p,{children:\"The official said it was going to be impossible but it turns out that God did it.\"}),(0,e.jsx)(t.h2,{id:\"unbelief-why\",children:\"Unbelief. Why?\"}),(0,e.jsx)(t.p,{children:\"Unbelief is because they have not submitted to God's way of doing things, they have not submitted to God's way of doing things. They have not submitted to God's right way of doing things.\"}),(0,e.jsx)(t.p,{children:\"The key to a miracle is that true faith needs submission, we need to submit to God and deny ourselves. Renounce our way of doing and thinking things. Notice that the people of Israel were stubborn and did not want to give up.\"}),(0,e.jsx)(t.h2,{id:\"the-apostle-paul-gives-us-these-steps-to-believe-in-the-miracle\",children:\"The apostle Paul gives us these steps to believe in the miracle.\"}),(0,e.jsxs)(t.ol,{children:[(0,e.jsx)(t.li,{children:\"Let us confess the Lord Jesus, and confess that we believe in his great power.\"}),(0,e.jsx)(t.li,{children:\"May we believe it in our heart, with our mind and soul.\"}),(0,e.jsx)(t.li,{children:\"Let us say it openly\"})]}),(0,e.jsx)(t.p,{children:\"You will not be ashamed of that Christ in whom you trust. He who believes with his heart will not be ashamed to say it with his mouth. He will not be ashamed to keep his trust in Christ. He will not be disappointed or humiliated by waiting on the times of God.\"})]})}}var k=v;return b(G);})();\n;return Component;","frontmatter":{"title":"A Miracle At Evening ...","abstract":"My personal notes of the predic \"A Miracle At Evening\" Of Pr. Daniel Chemes - Ekklesia - Salta, Argentina.","date":"2022-08-14","banner":"/static/hello-world-banner.jpg"},"timecode":"00:04:39:60","ogImage":"undefined/og/c803b1f2f231280506420271e6d44dee.png"},"__N_SSG":true}